In [1]:
import pandas as pd

## Домашнее задание

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [1]:
import requests
import zipfile

In [2]:
def unzip_files(zip_path, save_path):
    with zipfile.ZipFile(zip_path) as zip_file:
        for names in zip_file.namelist():
            print(names)
            zip_file.extract(names,save_path)

In [3]:
url =  "http://files.grouplens.org/datasets/movielens/ml-latest-small.zip"
zipFile = requests.get(url)

In [4]:
with open("ml-latest-small.zip", "wb") as f:
    f.write(zipFile.content)
unzip_files("ml-latest-small.zip", "")

ml-latest-small/
ml-latest-small/links.csv
ml-latest-small/tags.csv
ml-latest-small/ratings.csv
ml-latest-small/README.txt
ml-latest-small/movies.csv

In [6]:
ratings = pd.read_csv("./ml-latest-small/ratings.csv")
movies =  pd.read_csv("./ml-latest-small/movies.csv")

In [7]:
max_movie_rating = ratings[(ratings['rating'] == 5)]['movieId'].value_counts().idxmax()

In [8]:
most_five_stars_movie = movies[(movies['movieId'] == max_movie_rating)]
most_five_stars_movie

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [9]:
df = pd.read_csv("power.csv")
df.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [10]:
def is_baltic_state(country):
    baltic_states = ["Estonia","Latvia","Lithuania"]
    return country in baltic_states
print(is_baltic_state("Latvia"), is_baltic_state("Zambia"))

df['is_baltic'] = df['country'].apply(is_baltic_state)

True False

In [11]:
df[
    (df['is_baltic'] == True )
        & 
    (df['year'].isin( range(2005,2014,1) ) )
        &
    (df['category'].isin([4,12,21]))
        &
    (df['quantity'] >= 0)
]['quantity'].sum()

365275.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [12]:
# Википедия:Популярные статьи/2014/Категории
url = 'https://ru.wikipedia.org/wiki/%D0%92%D0%B8%D0%BA%D0%B8%D0%BF%D0%B5%D0%B4%D0%B8%D1%8F:%D0%9F%D0%BE%D0%BF%D1%83%D0%BB%D1%8F%D1%80%D0%BD%D1%8B%D0%B5_%D1%81%D1%82%D0%B0%D1%82%D1%8C%D0%B8/2014/%D0%9A%D0%B0%D1%82%D0%B5%D0%B3%D0%BE%D1%80%D0%B8%D0%B8'

df = pd.read_html(url)[0].set_index('#')
porn_categories = df[ df['Страница'].str.contains('порн', case=False) ]

df.head(5)

                             Страница  Число просмотров
#
1   Категория:Порноактрисы по странам              1601
2          Категория:Порноактрисы США               753
3  Категория:Порноактрисы по алфавиту               711
4          Категория:Фильмы 2014 года               710
5       Категория:Порноактрисы России               613

In [13]:
total_views_percent = porn_categories['Число просмотров'].sum() / df['Число просмотров'].sum()

print(f"В выборке из {len(df)} самых популярных категорий за 2014 год в Википедии, {len(porn_categories)} категории имеют отношение к порно.")
print(f"Суммарное количество просмотров этих категорий составило {total_views_percent:.2%} от всех... ¯\_(ツ)_/¯")

В выборке из 500 самых популярных категорий за 2014 год в Википедии, 32 категории имеют отношение к порно.
Суммарное количество просмотров этих категорий составило 13.95% от всех... ¯\_(ツ)_/¯

### Упражнение с занятия
Используем transactions.csv.

Для какой транзакции (столбец ID) были наибольшие расходы (столбец Cost) в категории "_8" (столбец Product)?

In [14]:
data2 = pd.read_csv('transactions.csv')
data2.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

In [15]:
data2[ data2['Product'] == "_8"].sort_values(by = 'Cost', ascending = False).head(1)

    Year  Month    ID Product  Amount  Price  Total  Cost
54  2017     12  t055      _8       2   3760   7520  2400

In [16]:
data2[ data2['Product'] == "_8"].sort_values(by = 'Cost', ascending = False)["ID"].iloc[0]

't055'